INSERT INTO users (id, login, password, is_moderator) VALUES
(1, 'user', 'user', false),
(2, 'admin', 'admin', true),
(3, 'user2', 'user2', false);

INSERT INTO chats (id, img, name, info, nickname, friends, subscribers) VALUES
(1, 'http://127.0.0.1:9000/test/1.png', 'Леонардо Ди Каприо', 'актёр, продюсер и активист, известный своими выдающимися ролями и вкладом в защиту окружающей среды.', '@leo_di', 500, 9213499),
(2, 'http://127.0.0.1:9000/test/2.png', 'Хью Джекман', 'Известен своей ролью Росомахи, также проявил себя в театре и кино', '@hyu_jack', 123, 882378),
(3, 'http://127.0.0.1:9000/test/3.png', 'Магнус Карлсен', 'Норвежский гроссмейстер, ставший чемпионом мира по шахматам', '@magnusK', 1, 321421),
(4, 'http://127.0.0.1:9000/test/4.png', 'Антон Канев', 'Гений, миллиардер, плейбой, филантроп и говорит (по мелочи) на китайском', '@neughost', 265, 8);

INSERT INTO lists (status, date_create, date_update, date_finish, creator_id, moderator_id) VALUES
('черновик', '2024-09-20 10:15:30', '2024-09-20 10:15:30', NULL, 1, 2),
('завершён', '2024-09-15 09:00:00', '2024-09-20 12:00:00', '2024-09-22 14:30:00', 1, 2),
('удалён', '2024-09-10 11:45:00', '2024-09-18 08:20:00', NULL, 3, 2),
('сформирован', '2024-09-12 14:30:00', '2024-09-19 09:45:00', NULL, 1, 2),
('отклонён', '2024-09-17 16:05:00', '2024-09-19 17:30:00', NULL, 3, 2);

INSERT INTO lists_chats (list_id, chat_id, messages_count) VALUES
(1, 1, 5),
(1, 2, 2),
(2, 1, 3),
(2, 3, 7),
(3, 2, 0),
(4, 1, 1),
(5, 3, 4);

